; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v3 ?v10)
             (pred_12 ?v7 ?v9)
             (pred_10 ?v3 ?v9)
             (pred_3 ?v1 ?v3 )
	     (pred_8 ?v3)
             (pred_7 ?v2)
             (pred_11 ?v7)
             (pred_9 ?v9)
             (pred_6 ?v3)
             (pred_1 ?v7)
             (pred_5 ?v3)
             (pred_4 ))



(:action op_4
:parameters (?v8 ?v13 ?v12 ?v4)
:precondition (and (pred_7 ?v8) (pred_7 ?v13) (pred_11 ?v12) (pred_9 ?v4)
          (pred_2 ?v8 ?v13) (pred_12 ?v12 ?v4)
                   (pred_10 ?v13 ?v4) (pred_8 ?v8) 
                   (pred_6 ?v13) (pred_1 ?v12))
:effect (and  (pred_5 ?v13) (not (pred_6 ?v13))))


(:action op_3
:parameters (?v8 ?v5)
:precondition (and (pred_7 ?v8) (pred_7 ?v5)
               (pred_8 ?v8) (pred_2 ?v8 ?v5) (pred_5 ?v5))
:effect (and (pred_8 ?v5) (not (pred_8 ?v8))))

(:action op_1
:parameters (?v8 ?v12)
:precondition (and (pred_7 ?v8) (pred_11 ?v12) 
                  (pred_8 ?v8) (pred_3 ?v12 ?v8) (pred_4 ))
:effect (and (pred_1 ?v12)
   (not (pred_3 ?v12 ?v8)) (not (pred_4 ))))


(:action op_5
:parameters (?v8 ?v11 ?v6)
:precondition (and (pred_7 ?v8) (pred_11 ?v11) (pred_11 ?v6)
                  (pred_8 ?v8) (pred_1 ?v6) (pred_3 ?v11 ?v8))
:effect (and (pred_1 ?v11) (pred_3 ?v6 ?v8)
        (not (pred_1 ?v6)) (not (pred_3 ?v11 ?v8))))

(:action op_2
:parameters (?v8 ?v12)
:precondition (and (pred_7 ?v8) (pred_11 ?v12) 
                  (pred_8 ?v8) (pred_1 ?v12))
:effect (and (pred_4 ) (pred_3 ?v12 ?v8) (not (pred_1 ?v12)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_02 obj_19 obj_28 obj_29 obj_10 obj_07 obj_08 obj_15 obj_20 obj_05 obj_23 obj_21 obj_01 obj_03 obj_04 obj_14 obj_16 obj_24 obj_22 obj_09 obj_26 obj_12 obj_11 obj_25 obj_30
    obj_13 obj_18
    obj_27 obj_06 obj_17
    )

    (:init
       (pred_4)

       (pred_7 obj_02)
       (pred_7 obj_19)
       (pred_7 obj_28)
       (pred_7 obj_29)
       (pred_7 obj_10)
       (pred_7 obj_07)
       (pred_7 obj_08)
       (pred_7 obj_15)
       (pred_7 obj_20)
       (pred_7 obj_05)
       (pred_7 obj_23)
       (pred_7 obj_21)
       (pred_7 obj_01)
       (pred_7 obj_03)
       (pred_7 obj_04)
       (pred_7 obj_14)
       (pred_7 obj_16)
       (pred_7 obj_24)
       (pred_7 obj_22)
       (pred_7 obj_09)
       (pred_7 obj_26)
       (pred_7 obj_12)
       (pred_7 obj_11)
       (pred_7 obj_25)
       (pred_7 obj_30)
       (pred_9 obj_13)
       (pred_9 obj_18)
       (pred_11 obj_27)
       (pred_11 obj_06)
       (pred_11 obj_17)

       (pred_2 obj_02 obj_07)
       (pred_2 obj_02 obj_19)
       (pred_2 obj_19 obj_08)
       (pred_2 obj_19 obj_28)
       (pred_2 obj_19 obj_02)
       (pred_2 obj_28 obj_15)
       (pred_2 obj_28 obj_29)
       (pred_2 obj_28 obj_19)
       (pred_2 obj_29 obj_20)
       (pred_2 obj_29 obj_10)
       (pred_2 obj_29 obj_28)
       (pred_2 obj_10 obj_05)
       (pred_2 obj_10 obj_29)
       (pred_2 obj_07 obj_23)
       (pred_2 obj_07 obj_08)
       (pred_2 obj_07 obj_02)
       (pred_2 obj_08 obj_21)
       (pred_2 obj_08 obj_15)
       (pred_2 obj_08 obj_19)
       (pred_2 obj_08 obj_07)
       (pred_2 obj_15 obj_01)
       (pred_2 obj_15 obj_20)
       (pred_2 obj_15 obj_28)
       (pred_2 obj_15 obj_08)
       (pred_2 obj_20 obj_03)
       (pred_2 obj_20 obj_05)
       (pred_2 obj_20 obj_29)
       (pred_2 obj_20 obj_15)
       (pred_2 obj_05 obj_04)
       (pred_2 obj_05 obj_10)
       (pred_2 obj_05 obj_20)
       (pred_2 obj_23 obj_14)
       (pred_2 obj_23 obj_21)
       (pred_2 obj_23 obj_07)
       (pred_2 obj_21 obj_16)
       (pred_2 obj_21 obj_01)
       (pred_2 obj_21 obj_08)
       (pred_2 obj_21 obj_23)
       (pred_2 obj_01 obj_24)
       (pred_2 obj_01 obj_03)
       (pred_2 obj_01 obj_15)
       (pred_2 obj_01 obj_21)
       (pred_2 obj_03 obj_22)
       (pred_2 obj_03 obj_04)
       (pred_2 obj_03 obj_20)
       (pred_2 obj_03 obj_01)
       (pred_2 obj_04 obj_09)
       (pred_2 obj_04 obj_05)
       (pred_2 obj_04 obj_03)
       (pred_2 obj_14 obj_26)
       (pred_2 obj_14 obj_16)
       (pred_2 obj_14 obj_23)
       (pred_2 obj_16 obj_12)
       (pred_2 obj_16 obj_24)
       (pred_2 obj_16 obj_21)
       (pred_2 obj_16 obj_14)
       (pred_2 obj_24 obj_11)
       (pred_2 obj_24 obj_22)
       (pred_2 obj_24 obj_01)
       (pred_2 obj_24 obj_16)
       (pred_2 obj_22 obj_25)
       (pred_2 obj_22 obj_09)
       (pred_2 obj_22 obj_03)
       (pred_2 obj_22 obj_24)
       (pred_2 obj_09 obj_30)
       (pred_2 obj_09 obj_04)
       (pred_2 obj_09 obj_22)
       (pred_2 obj_26 obj_12)
       (pred_2 obj_26 obj_14)
       (pred_2 obj_12 obj_11)
       (pred_2 obj_12 obj_16)
       (pred_2 obj_12 obj_26)
       (pred_2 obj_11 obj_25)
       (pred_2 obj_11 obj_24)
       (pred_2 obj_11 obj_12)
       (pred_2 obj_25 obj_30)
       (pred_2 obj_25 obj_22)
       (pred_2 obj_25 obj_11)
       (pred_2 obj_30 obj_09)
       (pred_2 obj_30 obj_25)
       (pred_6 obj_30)
       (pred_6 obj_03)
       (pred_6 obj_19)
       (pred_10  obj_30 obj_13)
       (pred_10  obj_03 obj_18)
       (pred_10  obj_19 obj_18)
       (pred_5 obj_02)
       (pred_5 obj_28)
       (pred_5 obj_29)
       (pred_5 obj_10)
       (pred_5 obj_07)
       (pred_5 obj_08)
       (pred_5 obj_15)
       (pred_5 obj_20)
       (pred_5 obj_05)
       (pred_5 obj_23)
       (pred_5 obj_21)
       (pred_5 obj_01)
       (pred_5 obj_04)
       (pred_5 obj_14)
       (pred_5 obj_16)
       (pred_5 obj_24)
       (pred_5 obj_22)
       (pred_5 obj_09)
       (pred_5 obj_26)
       (pred_5 obj_12)
       (pred_5 obj_11)
       (pred_5 obj_25)

       (pred_12  obj_27 obj_13)
       (pred_12  obj_06 obj_18)
       (pred_12  obj_17 obj_18)
       (pred_3 obj_27 obj_05)
       (pred_3 obj_06 obj_07)
       (pred_3 obj_17 obj_21)
       (pred_8 obj_04)
    )

    (:goal (and
       (pred_3 obj_27 obj_11)
       (pred_3 obj_06 obj_05)
    ))
(:constraints
  (always (not (pred_8 obj_15)))
)
)

; plan
1. (op_3 obj_04 obj_09)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_09)
   goals met: 0 of 2
2. (op_3 obj_09 obj_22)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_22)
   goals met: 0 of 2
3. (op_3 obj_22 obj_24)
   deleted: (pred_8 obj_22)
   added: (pred_8 obj_24)
   goals met: 0 of 2
4. (op_3 obj_24 obj_01)
   deleted: (pred_8 obj_24)
   added: (pred_8 obj_01)
   goals met: 0 of 2
5. (op_3 obj_01 obj_21)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_21)
   goals met: 0 of 2
6. (op_3 obj_21 obj_08)
   deleted: (pred_8 obj_21)
   added: (pred_8 obj_08)
   goals met: 0 of 2
7. (op_3 obj_08 obj_07)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_07)
   goals met: 0 of 2
8. (op_1 obj_07 obj_06)
   deleted: (pred_3 obj_06 obj_07) (pred_4)
   added: (pred_1 obj_06)
   goals met: 0 of 2
9. (op_3 obj_07 obj_08)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_08)
   goals met: 0 of 2
10. (op_3 obj_08 obj_21)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_21)
   goals met: 0 of 2
11. (op_3 obj_21 obj_01)
   deleted: (pred_8 obj_21)
   added: (pred_8 obj_01)
   goals met: 0 of 2
12. (op_4 obj_01 obj_03 obj_06 obj_18)
   deleted: (pred_6 obj_03)
   added: (pred_5 obj_03)
   goals met: 0 of 2
13. (op_3 obj_01 obj_03)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_03)
   goals met: 0 of 2
14. (op_3 obj_03 obj_20)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_20)
   goals met: 0 of 2
15. (op_3 obj_20 obj_05)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_05)
   goals met: 0 of 2
16. (op_5 obj_05 obj_27 obj_06)
   deleted: (pred_1 obj_06) (pred_3 obj_27 obj_05)
   added: (pred_1 obj_27) (pred_3 obj_06 obj_05)
   goals met: 1 of 2
17. (op_3 obj_05 obj_20)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_20)
   goals met: 1 of 2
18. (op_3 obj_20 obj_03)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_03)
   goals met: 1 of 2
19. (op_3 obj_03 obj_01)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_01)
   goals met: 1 of 2
20. (op_3 obj_01 obj_24)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_24)
   goals met: 1 of 2
21. (op_3 obj_24 obj_11)
   deleted: (pred_8 obj_24)
   added: (pred_8 obj_11)
   goals met: 1 of 2
22. (op_2 obj_11 obj_27)
   deleted: (pred_1 obj_27)
   added: (pred_4) (pred_3 obj_27 obj_11)
   goals met: 2 of 2
